
SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `s_infor`
-- ----------------------------
DROP TABLE IF EXISTS `s_infor`;
CREATE TABLE `s_infor` (`s_id` int(50) NOT NULL AUTO_INCREMENT,`name` varchar(50) NOT NULL, `sex` varchar(10) NOT NULL, `examineeNum` varchar(255) DEFAULT NULL, `identityNum` varchar(255) DEFAULT NULL, `political` varchar(50) NOT NULL,`phone` varchar(255) DEFAULT NULL, `address` varchar(255) NOT NULL,`province` varchar(50) NOT NULL,`acceptPerson` varchar(50) NOT NULL,`grades` double DEFAULT NULL,`p_id` int(50) NOT NULL, `d_id` int(50) NOT NULL, PRIMARY KEY (`s_id`)) ENGINE=InnoDB AUTO_INCREMENT=146 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of s_infor
-- ----------------------------
INSERT INTO `s_infor` VALUES ('100', '张无忌', '男', '1.0', '1.0', '团员', '1.0', '东极岛', '福建省', '张无忌', '1.0', '1', '1');
INSERT INTO `s_infor` VALUES ('101', '海贼索隆', '男', '1.0', '1.0', '无', '1.0', '南海', '日本省', '索隆', '1.0', '2', '1');
INSERT INTO `s_infor` VALUES ('102', '齐天悟空', '男', '1.0', '1.0', '妖圣', '1.0', '水帘洞', '傲来神洲', '齐天', '1.0', '3', '2');
INSERT INTO `s_infor` VALUES ('103', '无名', '男', '1.0', '1.0', '流', '1.0', '剑域', '万国', '的', '1.0', '4', '2');
INSERT INTO `s_infor` VALUES ('104', '额', '额', '2.0', '2.0', '发', '4.0', '放入', '非人非', '阿德', '5.0', '5', '2');
INSERT INTO `s_infor` VALUES ('105', '输入法个', '儿', '4.0', '4.0', '热水 ', '4.0', ' 热风', '放入', '钢铁股', '6.0', '6', '2');
INSERT INTO `s_infor` VALUES ('106', '擦', '放入', '5.0', '7.0', '的', '6.0', '方式', '沙发上', '还有', '8.0', '7', '2');
INSERT INTO `s_infor` VALUES ('107', '定位', 'ec', '4.0', '4.0', '色', '9.0', '上网', '据', ' 看ik', '8.0', '8', '3');
INSERT INTO `s_infor` VALUES ('108', '测定', 'cdc', '5.0', '5.0', '认同感', '7.0', '方式', 'u', '咯', '8.0', '9', '3');
INSERT INTO `s_infor` VALUES ('109', 'fvf', 'cd', '5.0', '5.0', '阿德', '6.0', '认同感', '入围 ', '放入', '9.0', '10', '3');
INSERT INTO `s_infor` VALUES ('110', '啊饿的', '萨芬', '6.0', '6.0', '阿德', '7.0', '认同感', '入围 ', '放入', '10.0', '11', '3');
INSERT INTO `s_infor` VALUES ('111', '啊饿的', 'cdc', '7.0', '7.0', '阿德', '8.0', '认同感', '入围 ', '放入', '11.0', '12', '4');
INSERT INTO `s_infor` VALUES ('112', '啊饿的', 'nan', '8.0', '8.0', '阿德', '9.0', '认同感', '入围 ', '放入', '12.0', '12', '4');
INSERT INTO `s_infor` VALUES ('113', '啊饿的', 'sdv', '9.0', '9.0', '阿德', '10.0', '认同感', '入围 ', '放入', '13.0', '12', '4');
INSERT INTO `s_infor` VALUES ('114', '啊饿的', 'fr ', '10.0', '10.0', '阿德', '11.0', '认同感', '入围 ', '放入', '14.0', '12', '4');
INSERT INTO `s_infor` VALUES ('115', '啊饿的', 'sfe芬', '11.0', '11.0', '阿德', '12.0', '认同感', '入围 ', '放入', '15.0', '12', '4');
INSERT INTO `s_infor` VALUES ('116', '啊饿的', 's f ', '12.0', '12.0', '阿德', '13.0', '认同感', '入围 ', '放入', '16.0', '17', '5');
INSERT INTO `s_infor` VALUES ('117', '啊饿的', '萨芬', '13.0', '13.0', '阿德', '14.0', '认同感', '入围 ', '放入', '17.0', '18', '5');
INSERT INTO `s_infor` VALUES ('118', '啊饿的', '萨芬', '14.0', '14.0', '阿德', '15.0', '认同感', '入围 ', '放入', '18.0', '19', '5');
INSERT INTO `s_infor` VALUES ('119', '啊饿的', '萨芬', '15.0', '15.0', '阿德', '16.0', '认同感', '入围 ', '放入', '19.0', '20', '5');
INSERT INTO `s_infor` VALUES ('120', '啊饿的', '萨芬', '16.0', '16.0', '阿德', '17.0', '认同感', '入围 ', '放入', '20.0', '21', '6');
INSERT INTO `s_infor` VALUES ('121', '啊饿的', '萨芬', '17.0', '17.0', '阿德', '18.0', '认同感', '入围 ', '放入', '21.0', '22', '6');
INSERT INTO `s_infor` VALUES ('122', '啊饿的', '萨芬', '18.0', '18.0', '阿德', '19.0', '认同感', '入围 ', '放入', '22.0', '23', '6');
INSERT INTO `s_infor` VALUES ('123', '啊饿的', '萨芬', '19.0', '19.0', '阿德', '20.0', '认同感', '入围 ', '放入', '23.0', '24', '7');
INSERT INTO `s_infor` VALUES ('124', '啊饿的', '萨芬', '20.0', '20.0', '阿德', '21.0', '认同感', '入围 ', '放入', '24.0', '25', '7');
INSERT INTO `s_infor` VALUES ('125', '啊饿的', '萨芬', '21.0', '21.0', '阿德', '22.0', '认同感', '入围 ', '放入', '25.0', '26', '7');
INSERT INTO `s_infor` VALUES ('126', '啊饿的', '萨芬', '22.0', '22.0', '阿德', '23.0', '认同感', '入围 ', '放入', '26.0', '27', '8');
INSERT INTO `s_infor` VALUES ('127', '啊饿的', '萨芬', '23.0', '23.0', '阿德', '24.0', '认同感', '入围 ', '放入', '27.0', '28', '8');
INSERT INTO `s_infor` VALUES ('128', '啊饿的', '萨芬', '24.0', '24.0', '阿德', '25.0', '认同感', '入围 ', '放入', '28.0', '29', '8');
INSERT INTO `s_infor` VALUES ('129', '啊饿的', '萨芬', '25.0', '25.0', '阿德', '26.0', '认同感', '入围 ', '放入', '29.0', '30', '8');
INSERT INTO `s_infor` VALUES ('130', '啊饿的', '萨芬', '26.0', '26.0', '阿德', '27.0', '认同感', '入围 ', '放入', '30.0', '31', '9');
INSERT INTO `s_infor` VALUES ('131', '啊饿的', '萨芬', '27.0', '27.0', '阿德', '28.0', '认同感', '入围 ', '放入', '31.0', '32', '9');
INSERT INTO `s_infor` VALUES ('132', '啊饿的', '萨芬', '28.0', '28.0', '阿德', '29.0', '认同感', '入围 ', '放入', '32.0', '33', '9');
INSERT INTO `s_infor` VALUES ('133', '啊饿的', '萨芬', '29.0', '29.0', '阿德', '30.0', '认同感', '入围 ', '放入', '33.0', '34', '9');
INSERT INTO `s_infor` VALUES ('134', '啊饿的', '萨芬', '30.0', '30.0', '阿德', '31.0', '认同感', '入围 ', '放入', '34.0', '35', '9');
INSERT INTO `s_infor` VALUES ('135', '啊饿的', '萨芬', '31.0', '31.0', '阿德', '32.0', '认同感', '入围 ', '放入', '35.0', '36', '9');
INSERT INTO `s_infor` VALUES ('136', '啊饿的', '萨芬', '32.0', '32.0', '阿德', '33.0', '认同感', '入围 ', '放入', '36.0', '37', '9');
INSERT INTO `s_infor` VALUES ('137', '啊饿的', '萨芬', '33.0', '33.0', '阿德', '34.0', '认同感', '入围 ', '放入', '37.0', '38', '9');
INSERT INTO `s_infor` VALUES ('138', '啊饿的', '萨芬', '34.0', '34.0', '阿德', '35.0', '认同感', '入围 ', '放入', '38.0', '39', '9');
INSERT INTO `s_infor` VALUES ('139', '啊饿的', '萨芬', '35.0', '35.0', '阿德', '36.0', '认同感', '入围 ', '放入', '39.0', '40', '9');
INSERT INTO `s_infor` VALUES ('140', '啊饿的', '萨芬', '36.0', '36.0', '阿德', '37.0', '认同感', '入围 ', '放入', '40.0', '41', '9');
INSERT INTO `s_infor` VALUES ('141', '啊饿的', '萨芬', '37.0', '37.0', '阿德', '38.0', '认同感', '入围 ', '放入', '41.0', '42', '10');
INSERT INTO `s_infor` VALUES ('142', '啊饿的', '萨芬', '38.0', '38.0', '阿德', '39.0', '认同感', '入围 ', '放入', '42.0', '43', '10');
INSERT INTO `s_infor` VALUES ('143', '啊饿的', '萨芬', '39.0', '39.0', '阿德', '40.0', '认同感', '入围 ', '放入', '43.0', '44', '12');
INSERT INTO `s_infor` VALUES ('144', '啊饿的', '萨芬', '40.0', '40.0', '阿德', '41.0', '认同感', '入围 ', '放入', '44.0', '45', '12');
INSERT INTO `s_infor` VALUES ('145', '啊饿的', '萨芬', '41.0', '41.0', '阿德', '42.0', '认同感', '入围 ', '放入', '45.0', '46', '12');
